CSI API ETABS v1

# cDesignShearWall Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDesignShearWall

    Public Interface cDesignShearWall

    Dim instance As cDesignShearWall

    public interface class cDesignShearWall

    type cDesignShearWall =  interface end

The cDesignShearWall type exposes the following members.

Methods

| Name| Description
---|---|---
|
GetPierSummaryResults|
|
GetRebar|
|
GetRebarPrefsPier|  Retrieves data
from the Rebar Selection Rules for Wall Piers
|
GetRebarPrefsSpandrel|  Retrieves
data from the Rebar Selection Rules for Wall Spandrels
|
GetSpandrelSummaryResults|
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com